# Module 4: Data Preparation

## What is Data Preparation about?
* So far we have learned NumPy, pandas, and how to read/write data
* We also need to consider: 
 * Data cleaning
 * Data transformation
 * Data formatting
* Data preparation usually happens after loading data into a DataFrame

# Missing Data

In [20]:
import pandas as pd
air = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/datasets/airquality.csv')
air

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
4             5    NaN      NaN  14.3    56      5    5
..          ...    ...      ...   ...   ...    ...  ...
148         149   30.0    193.0   6.9    70      9   26
149         150    NaN    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[153 rows x 7 columns]

In [21]:
# We have built-in functions to detect missing data
# Look at, e.g., rows 4 and 149
air.isnull()

     Unnamed: 0  Ozone  Solar.R   Wind   Temp  Month    Day
0         False  False    False  False  False  False  False
1         False  False    False  False  False  False  False
2         False  False    False  False  False  False  False
3         False  False    False  False  False  False  False
4         False   True     True  False  False  False  False
..          ...    ...      ...    ...    ...    ...    ...
148       False  False    False  False  False  False  False
149       False   True    False  False  False  False  False
150       False  False    False  False  False  False  False
151       False  False    False  False  False  False  False
152       False  False    False  False  False  False  False

[153 rows x 7 columns]

In [22]:
# We can also just filter it out completely, if we want to...
# e.g., We can just drop rows 4 and 149 entirely
air.dropna()

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
6             7   23.0    299.0   8.6    65      5    7
..          ...    ...      ...   ...   ...    ...  ...
147         148   14.0     20.0  16.6    63      9   25
148         149   30.0    193.0   6.9    70      9   26
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[111 rows x 7 columns]

In [23]:
# If we want to be a little more careful, you can only drop rows
# that are _all_ missing data (in this case, none are dropped)
air.dropna(how='all')

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
4             5    NaN      NaN  14.3    56      5    5
..          ...    ...      ...   ...   ...    ...  ...
148         149   30.0    193.0   6.9    70      9   26
149         150    NaN    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[153 rows x 7 columns]

In [24]:
# And of course, we can do this for columns instead of rows, too
air.dropna(axis='columns')

     Unnamed: 0  Wind  Temp  Month  Day
0             1   7.4    67      5    1
1             2   8.0    72      5    2
2             3  12.6    74      5    3
3             4  11.5    62      5    4
4             5  14.3    56      5    5
..          ...   ...   ...    ...  ...
148         149   6.9    70      9   26
149         150  13.2    77      9   27
150         151  14.3    75      9   28
151         152   8.0    76      9   29
152         153  11.5    68      9   30

[153 rows x 5 columns]

In [25]:
# What if we want to fill those values in, instead?
# We need to provide a reasonable value ... 
air.fillna(0)

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
4             5    0.0      0.0  14.3    56      5    5
..          ...    ...      ...   ...   ...    ...  ...
148         149   30.0    193.0   6.9    70      9   26
149         150    0.0    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[153 rows x 7 columns]

In [26]:
# 0 might not actually make much sense though - in which case we might want to use a more complex method
# ffill will take the most recent non-empty value and fill it forward
# Look at rows 4 and 149 again
air.fillna(method='ffill')

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
4             5   18.0    313.0  14.3    56      5    5
..          ...    ...      ...   ...   ...    ...  ...
148         149   30.0    193.0   6.9    70      9   26
149         150   30.0    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[153 rows x 7 columns]

# Data Transformation
Data transformation includes:
* Data filtering
* Outlier detection and removal

In [27]:
# let's create a dataframe with duplicate rows
air2 = pd.concat([air[:3], air[:3]])
air2

   Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0           1   41.0    190.0   7.4    67      5    1
1           2   36.0    118.0   8.0    72      5    2
2           3   12.0    149.0  12.6    74      5    3
0           1   41.0    190.0   7.4    67      5    1
1           2   36.0    118.0   8.0    72      5    2
2           3   12.0    149.0  12.6    74      5    3

In [28]:
# check if there are duplicate rows
air2.duplicated()

0    False
1    False
2    False
0     True
1     True
2     True
dtype: bool

In [29]:
# dropping duplicate rows is easy
# first rows are kept by default 
# if you want to keep last rows, pass "take_last=True"
air2.drop_duplicates()

   Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0           1   41.0    190.0   7.4    67      5    1
1           2   36.0    118.0   8.0    72      5    2
2           3   12.0    149.0  12.6    74      5    3

In [33]:
# Looking at the data, it looks like Temp is in F instead of C
# Let's correct that
air['Temp'] = (air['Temp']-32)*(5/9)
air

     Unnamed: 0  Ozone  Solar.R  Wind       Temp      Month  Day      Temp2
0             1   41.0    190.0   7.4  19.444444      March    1  19.444444
1             2   36.0    118.0   8.0  22.222222      March    2  22.222222
2             3   12.0    149.0  12.6  23.333333      March    3  23.333333
3             4   18.0    313.0  11.5  16.666667      March    4  16.666667
4             5    NaN      NaN  14.3  13.333333      March    5  13.333333
..          ...    ...      ...   ...        ...        ...  ...        ...
148         149   30.0    193.0   6.9  21.111111  September   26  21.111111
149         150    NaN    145.0  13.2  25.000000  September   27  25.000000
150         151   14.0    191.0  14.3  23.888889  September   28  23.888889
151         152   18.0    131.0   8.0  24.444444  September   29  24.444444
152         153   20.0    223.0  11.5  20.000000  September   30  20.000000

[153 rows x 8 columns]

In [30]:
# you can also map data in a dataframe or series
# for example, let's map month numbers to their real names
# This can be useful for data where you have numerical codes that correspond to categories 
months = {1: 'January', 2: 'February', 5: 'March', 9: 'September'}
air['Month_Name'] = air['Month'].map(months)
air

     Unnamed: 0  Ozone  Solar.R  Wind  Temp      Month  Day
0             1   41.0    190.0   7.4    67      March    1
1             2   36.0    118.0   8.0    72      March    2
2             3   12.0    149.0  12.6    74      March    3
3             4   18.0    313.0  11.5    62      March    4
4             5    NaN      NaN  14.3    56      March    5
..          ...    ...      ...   ...   ...        ...  ...
148         149   30.0    193.0   6.9    70  September   26
149         150    NaN    145.0  13.2    77  September   27
150         151   14.0    191.0  14.3    75  September   28
151         152   18.0    131.0   8.0    76  September   29
152         153   20.0    223.0  11.5    68  September   30

[153 rows x 7 columns]

In [34]:
# similarly, data can be replaced easily as well
air['Month'].replace([5, 9], ['March', 'January'])

0          March
1          March
2          March
3          March
4          March
         ...
148    September
149    September
150    September
151    September
152    September
Name: Month, Length: 153, dtype: object

In [35]:
# you can rename or modify axis indexes
air.rename(columns=str.upper)

     UNNAMED: 0  OZONE  SOLAR.R  WIND       TEMP      MONTH  DAY      TEMP2
0             1   41.0    190.0   7.4  19.444444      March    1  19.444444
1             2   36.0    118.0   8.0  22.222222      March    2  22.222222
2             3   12.0    149.0  12.6  23.333333      March    3  23.333333
3             4   18.0    313.0  11.5  16.666667      March    4  16.666667
4             5    NaN      NaN  14.3  13.333333      March    5  13.333333
..          ...    ...      ...   ...        ...        ...  ...        ...
148         149   30.0    193.0   6.9  21.111111  September   26  21.111111
149         150    NaN    145.0  13.2  25.000000  September   27  25.000000
150         151   14.0    191.0  14.3  23.888889  September   28  23.888889
151         152   18.0    131.0   8.0  24.444444  September   29  24.444444
152         153   20.0    223.0  11.5  20.000000  September   30  20.000000

[153 rows x 8 columns]

# Basic String Operations
* A very quick glance at some string operations
* Regular expressions will be covered in Module 5

In [276]:
# break a string into pieces
string = 'a, b, c, d'
string.split(',')

['a', ' b', ' c', ' d']

In [277]:
# get rid of whitespace
[x.strip() for x in string.split(',')]

['a', 'b', 'c', 'd']

In [278]:
# find a substring
# index is returned
string.find('b')

3

In [279]:
# replace a substring
string.replace(', ', '|')

'a|b|c|d'